# Напишите функцию для транспонирования матрицы
import numpy as np


matrix = [[4, 3, 64], [22, 2, 9]]

arr_matr = np.array(matrix)
print(arr_matr)
result =  np.transpose(arr_matr)
print(result)