# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.

b = int(input('Введите число: '))
if b == 6 or  b == 7:
    print ('Да, выходной день!!!')
else:
    print ('Нет(')

